bench/m0-redux/results/2026-09-24/mtp-k7/code-c8-greedy-thinkoff-s10.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7673bcf96fc0>, trust_remote_code=False, seed=10, num_prompts=160, dataset_name='hf', no_stream=False, dataset_path='likaixin/InstructCoder', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=512, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='nvidia/Qwen3.8-27B-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=4, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=mtp-k7', 'cell=code', 'sampling=greedy', 'thinking=off', 'max_model_len=262144', 'seed=10'], result_dir='/workspace/m0-redux/results/2026-09-24/mtp-k7', result_filename='code-c8-greedy-thinkoff-s10.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-37eef243-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'chat_template_kwargs': {'enable_thinking': False}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 4 requests...
100%|██████████| 4/4 [00:00<00:00,  5.63it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 160/160 [00:32<00:00,  4.87it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  32.83     
Total input tokens:                      26359     
Total generated tokens:                  32472     
Request throughput (req/s):              4.87      
Output token throughput (tok/s):         988.96    
Peak output token throughput (tok/s):    207.00    
Peak concurrent requests:                17.00     
Total token throughput (tok/s):          1791.75   
---------------Time to First Token----------------
Mean TTFT (ms):                          182.41    
Median TTFT (ms):                        165.59    
P50 TTFT (ms):                           165.59    
P90 TTFT (ms):                           260.70    
P99 TTFT (ms):                           292.13    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.58      
Median TPOT (ms):                        6.49      
P50 TPOT (ms):                           6.49      
P90 TPOT (ms):                           8.23      
P99 TPOT (ms):                           9.97      
---------------Inter-token Latency----------------
Mean ITL (ms):                           41.27     
Median ITL (ms):                         32.36     
P50 ITL (ms):                            32.36     
P90 ITL (ms):                            130.15    
P99 ITL (ms):                            132.08    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1616.89   
Median E2EL (ms):                        1093.74   
P50 E2EL (ms):                           1093.74   
P90 E2EL (ms):                           3752.95   
P99 E2EL (ms):                           4990.51   
---------------Speculative Decoding---------------
Acceptance rate (%):                     74.61     
Acceptance length:                       6.22      
Drafts:                                  5262      
Draft tokens:                            36834     
Accepted tokens:                         27481     
Per-position acceptance (%):
  Position 0:                            94.94     
  Position 1:                            88.67     
  Position 2:                            81.43     
  Position 3:                            74.48     
  Position 4:                            67.12     
  Position 5:                            60.97     
  Position 6:                            54.64     
==================================================